# Mixin представляет собой набор свойств и методов , 
# которые могут быть использованы в различных классах,
# которые не приходят из базового класса.

 class RadioUserMixin(object):
   def __init__(self):
       self.radio = Radio()

   def play_song_on_station(self, station):
       self.radio.set_station(station)
       self.radio.play_song()

# С миксинами важно то, что они позволяют вам добавлять функциональные возможности к разным объектам,
# которые не разделяют «основной» подкласс с этой функциональностью,
#  но, тем не менее, совместно используют код для него